#version: 0.2
Ġ Ġ
ĠĠ ĠĠ
ĠĠ Ġ
Ċ ĠĠĠĠ
i n
e n
o n
e r
a t
o r
e l
Ġ t
ĊĠĠĠĠ ĠĠĠ
ĊĠĠĠĠ ĠĠĠĠ
e s
Ġ s
u t
Ġ =
a s
a l
i on
e d
o d
e t
Ċ ĠĠĠ
a r
h e
a n
ĊĠĠĠĠĠĠĠĠ ĠĠĠ
Ġ i
s t
c h
r o
el f
Ġ d
in g
i t
Ġ c
Ġ f
p ut
i d
i c
Ġ "
r e
Ġ p
l e
i g
Ġ m
Ġ in
l o
en t
od el
s e
Ġt he
i z
m p
Ġ n
ĊĠĠĠĠĠĠĠĠ ĠĠĠĠ
a d
Ġ o
Ġs elf
p e
Ġt o
r a
e x
Ġ b
l a
Ġ w
m a
u r
k en
c e
Ġ r
u m
on f
onf ig
ĊĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠ
) :
Ġ (
c t
Ġ a
at t
t o
as s
g e
a m
Ġd e
p t
u n
ut put
u l
iz e
ã ģ
on e
an d
Ġi s
c od
" ,
q u
i m
or ch
at ion
er s
or m
Ġi f
h t
i s
Ġ `
( )
e m
Ġ l
es t
Ġ T
ra in
s or
Ċ ĊĠĠĠĠĠĠĠ
N one
ent ion
Ġ -
s elf
p o
i l
o t
Ġo f
c k
ar g
Ġ [
i f
Ġf or
at e
as k
att ention
m odel
s ize
Ġ #
d en
Ġm odel
o l
Ċ ĊĠĠĠ
ex t
ro m
u s
Ġ h
Ġ *
u e
id den
d e
Ġde f
l ass
ma ge
Ġ None
u p
cod er
at ch
ur n
et urn
p ro
t h
en sor
v al
it h
" :
c onfig
er t
or t
to ken
ã ĥ
a b
em b
Ġ g
Ġ and
v e
p s
y pe
in t
ĊĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠ
i st
am e
Ġ )
o m
Ġr eturn
ic t
Ġ {
arg s
" )
at es
ã Ĥ
la y
emb ed
ig ht
_ _
k e
in put
ion al
ul t
i p
/ /
Ġn ot
m ask
al l
Ġ A
i r
Ġt h
Ġs t
st ates
o utput
mp ort
iz er
id s
t orch
l en
f orm
r an
Ġ lo
c lass
" "
d ing
c es
p r
h a
Ġ C
Ġo utput
h idden
Ġin put
a mp
- -
` `
Ġ re
> >
t ype
la b
pt ional
Ġ L
Ġ S
f rom
] ,
Ġto ken
ic e
Ġ O
Ġ I
. .
in e
el s
Ġ el
he ad
ran s
en ce
Ġc onfig
at as
atas et
g g
o c
( "
Ġ or
st r
Ġt orch
c he
p y
r ue
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠ
ha pe
Ġb e
Ġw ith
ke y
r es
s s
c on
at h
as t
g th
n ame
e ight
M odel
" ]
u b
en coder
en er
Ġ v
Ġ e
at a
) ,
lay er
u se
Ġ P
Ġ ex
mp t
ar e
Ġn um
= "
rain ed
Ċ Ċ
Ġi mport
Ġp ro
Ġc on
d ict
o w
Ġs e
r i
f a
rans form
T ensor
Ġm a
c o
ĠĠĠĠ ĠĠĠĠ
i le
ab le
v ice
Ġ F
n um
Ġ +
: //
ht t
Ġ D
t ext
) .
len gth
[ "
ic en
Ġ un
b atch
i x
i al
Ġf rom
Ġel se
Ġ y
t er
o s
lo ck
d er
if f
: :
gg ing
i mage
ass ert
lo at
Ġ on
c al
Ġ ì
e w
l y
e at
Ġ( `
e ct
embed ding
in it
ad d
htt ps
al se
t est
o u
) )
u re
Ġ attention
b o
as e
e ps
` ,
p p
Ġh idden
ar d
T rue
Ġi mage
ar t
p ath
d im
it ion
val u
et rained
k w
Ġ" ""
Ġ }
amp le
kw args
an ce
Ġ as
# #
e p
en d
Ġ W
od u
rain ing
v er
qu ence
a ge
icen se
ĠO ptional
in d
Ġ R
Ġ _
Ġ M
Ġ B
ar am
Ġ use
u gging
lab els
Ġ us
s hape
input s
Ġr es
w eight
>> >
ent s
iff us
l es
an n
Ġw h
ip el
p re
F or
valu es
i ve
odu le
a ult
Ġdef ault
it s
if ic
val ue
an t
ch ed
pe c
f f
`` `
or e
po int
I N
Ġ V
de vice
c om
g es
Ġth at
Ġp r
p a
Ġ* *
Ġ= =
ransform ers
p er
o ptional
d ataset
ĠT he
ĠL icense
at or
po s
Ġt est
i se
ces sor
embedding s
fa ce
* *
c a
att n
Ġ '
Ġ x
lay ers
ipel ine
a ve
] (
lo ad
Ġc o
pr etrained
ã Ģ
T o
ct or
Ġ an
n orm
pro mpt
ma x
Ġb atch
head s
embed s
il l
attention s
lo g
t ensor
ck point
i v
a v
Ġth is
c c
ct ion
token s
Ġ are
ces s
e g
Ċ ĊĠĠĠĠĠĠĠĠĠĠĠ
d ir
l i
ch ann
lo w
f t
d s
ow n
Ġl et
r or
w ard
ched ul
Ġt ext
ugging face
b lock
.. .
ì Ŀ
Ġy ou
f or
Ġst r
t rain
g et
Ġ ë
o ut
-- --
Ġ en
i as
C onfig
Ċ Ġ
ut o
f eat
i o
To ken
Ġb y
up le
a y
Ġg ener
h uggingface
cod e
ur es
Ġ- >
de coder
u d
O N
Ġ U
Ġin t
Ġinput s
p l
po ut
Ġi t
i mport
ro pout
Ġ E
at ed
id e
j ect
f ile
b a
ma ges
chedul er
cal e
í ķ
Ġs h
Ġl en
d ata
n et
chann els
st ate
Ġ k
ar y
f er
Ġc an
Ġ all
Ġw e
Ġg et
Ġ al
Ġ N
Ġ G
ĠĠĠĠ ĠĠĠ
c l
ri b
t im
an g
et h
is ion
] )
Ġtoken izer
n ing
s et
Ġ encoder
Ġp re
Ġd ataset
o ol
Ġ H
ific ation
r ad
F alse
pe ct
oc ab
Ġ |
` ):
output s
amp les
ion s
it y
Ġ __
o ur
Ġre qu
__ (
rib ut
L I
g ener
at ive
Ġn n
' ,
qu al
iffus ion
a i
con v
Ġc lass
Ġse quence
Ġ layer
Ġm ask
i re
Ġma x
] ]
ed ict
Ġ at
ra y
u st
Ġ- -
ĠI n
r ror
et a
Ġs et
um ent
Ġs up
Ġt f
er n
() .
m ent
Ġw ill
il s
d oc
Ġ key
o k
t a
E rror
Ġd o
` ]
. _
Ġ ra
Ġ qu
od e
ë ĭ
pro b
Ġc he
Ġ[ `
Ġt raining
Ġw eight
f loat
Ġ j
token izer
Ġoutput s
Ġun der
ro ss
Ġ >>>
st eps
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
p aram
Ġc om
ad ding
Ġlo ad
u al
R A
st ance
er e
b ias
o b
L M
Ġ //
h is
t f
Ġ <
ic es
Token izer
a pt
p i
ãģ ®
lab le
in al
Ġ &
de f
* ,
s c
"" "
Ġs pec
pos ition
Ġs hape
Ġ :
Ġ \
a ct
on g
Ġ @
A R
Ġ assert
d type
T I
s er
model s
Ġd ata
ar ray
ers ion
Ġp ass
N et
et r
Ġdefault s
Ġ .
bo ol
Ġ[ "
um m
Ġ add
b u
Ġpro mpt
che ckpoint
` .
Ġt ransformers
ãģ Ļ
if i
ind ex
c ol
d ropout
Ġn ame
e e
ist ribut
Ġus ed
er m
( [
A S
ut ils
es s
pect ed
Ġde coder
p ar
a ch
s w
st art
la x
Ġn ew
F loat
Ġlo ss
P U
n n
Ġd im
Float Tensor
ai lable
log its
n p
ro p
ul d
Ġde vice
Ġra ise
Ġ args
pl it
ine ar
ĠF alse
r it
E qual
ca che
s ample
iz ation
fer ence
S T
b ert
Ġn o
ce pt
lo ss
Ġ /
el er
se q
Ġh as
cc eler
Ġp ar
e c
id x
Ġrequ ir
Ġ value
er y
g rad
ext ra
i ent
O utput
f ix
Ġt im
re ate
Ġp os
al ue
r un
Ġf ile
D E
istribut ed
Ġin d
s cale
i mages
p u
Ġ ...
ith ub
lab el
Ġin st
i b
feat ures
ãĢ ģ
g ithub
P ro
Ġ ch
I n
o uld
in stance
Ġco mp
iz ed
ãĥ ¼
a pp
} .
pro cess
C on
ãĢ Ĥ
ri pt
I mage
p are
Ġin it
up y
upy ter
Ġt ype
Ġn e
Ġs ize
ãĤ Ĵ
j upyter
ĠT F
or g
or y
Ġl ist
r g
ma in
( ):
w or
Ġo b
Ġt ensor
Ġo ut
arg et
p ort
lo b
ang u
ransform er
Ġs o
p en
Ġf eat
ation s
ĠT rue
ĠU n
id th
w w
ta in
b ase
ro up
str ing
E R
[ :
Ġn p
Ġp aram
f o
ad apt
Ġma y
s pec
Ġd type
= =
Ġ head
Ġtoken s
pro cessor
m o
f il
i es
Ġt rain
C lass
iffus ers
at ents
Ġ le
v ocab
ĠV alue
Ġwh en
ra m
E S
weight s
n o
E N
Ġ >
d own
Ġlo g
Ġs c
l ist
etr ic
angu age
P re
ĊĠĠĠĠ Ġ
th on
pt im
i ch
S e
* ):
) ;
ĠA uto
L ay
e mp
P ipeline
u mp
ur ation
Ġis instance
eth od
ar ning
Ġex pected
Ġsup er
gg er
an ge
ba ck
T est
or es
eg ative
r c
Ġel if
ĊĠĠĠĠĠĠĠĠ Ġ
() ,
ãģ «
s h
ĠT his
t ro
M A
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
arg ument
Ġb ool
con d
b er
t able
Ġa pp
or a
um n
el p
Ġweight s
un ction
Ġfor ward
et ers
) ?
pro j
e ch
ĠI f
n ew
Y ou
] .
Ġd istributed
L ist
IN G
umm y
Ġsh ould
ĉ ĉ
ix el
t t
ir st
ĠC o
m odule
l ic
ar ch
n am
Ġh ave
r ate
ĠValue Error
O C
Ġcon v
---- ----
O R
Ġ up
as h
Ġe ach
Ġ labels
' s
w ith
z er
ud io
Ġ la
Ġpos ition
ma p
class es
assert Equal
av ailable
ig n
ãģ Ĺ
à °
ãģ ¾
att r
and om
re e
Ġi mp
D I
Ġres ult
v i
' :
u id
Ġus ing
s o
P T
Ġp adding
e ad
it ional
p ast
Ġb lock
n d
m l
Ġ K
t raining
he ight
( (
a f
Ġ= >
Ġ` (
Lay er
e val
test er
tro l
Pro cessor
D e
s on
Ġ attn
l ice
e am
Ġche ckpoint
amp l
ifi er
" ],
pa che
Ġw or
Ġy our
p atch
Class ification
e an
v ision
M odule
icen s
Ġ ê
Ġ https
. "
ern el
ig inal
p la
} ,
Ġc all
Ġmodel s
ĠR es
en s
adapt er
Ġp ast
Pre T
is s
") ,
m b
ì Ĺ
en ces
Ġm odule
st ep
o ad
h ub
pre fix
N orm
cod ing
key s
T he
ro w
est ion
app end
ĠC on
t ransformers
ãĥ ³
Ġon ly
Ġp a
Ġ í
dataset s
Ġ one
Ġc a
i e
c ken
ar k
t r
pe ech
E T
s cheduler
ult ip
ãĤ ĭ
s ave
C H
val id
o ver
che ck
Ġst ate
ãģ ¯
t he
Ġcon st
fa ult
Ġwh ich
all y
sw er
ol ut
Ġ u
it em
E n
S E
ĠI mage
spec ial
tim e
in es
Ġne ed
c y
em ory
uid ance
> <
f g
ĠP y
o g
py torch
un d
ãģ §
Ġp er
s plit
re qu
ĠA rg
a e
Ġ( "
l l
TI ON
c at
E D
ëĭ ¤
a ce
ĠS ee
( &
re ad
r el
r eturn
Ġ embeddings
ãĥ Ī
p ad
ä ¸
Ġ !
pr edict
ĠD e
i ate
Ġinit ial
for ward
us al
k ip
bo ok
pt h
Ġf loat
[ -
Ã ©
a x
h o
Ġcom put
Ġl anguage
Ġpr edict
o ff
ul l
"] )
Ġr un
Ġb ut
se quence
pla ce
Ġo s
ĠW h
Ġc ol
Ġf il
ï ¼
íķ ĺ
u ct
re g
v ed
PreT rained
ba cken
Ġpar ser
i el
ar i
c all
O DE
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
est eps
py thon
Ġn orm
param s
` :
a k
Ġm ore
F I
Ġ{ "
ĠArg s
om e
ð Ł
Ċ ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
lob al
cceler ator
ëĭ Ī
pre pare
eth er
m on
Ġi mages
Ġ ):
bu il
(). __
Ġst art
s lice
en ame
Ġm ethod
() )
B ert
r ight
Ġse q
Ġp ipeline
un k
y p
Ġ layers
LI P
in fo
< /
ot e
it er
Ġi d
Ġv ocab
â ĸ
ë Ĭ
po ch
a g
ëĭĪ ëĭ¤
= '
et ad
block s
Ġd own
ve c
Ġex cept
ump y
Ġf n
etad ata
n g
Ġa g
a ck
Ġh elp
l m
P R
i mp
ur l
model ing
Ġnum ber
Ġb u
Ġ} ,
d iffusion
T H
ultip le
g roup
## ##
Ġrequir ed
ãģ¾ ãģĻ
Ġd ict
z e
i pe
co mp
Ġlog its
ĠL ist
in ference
Ġ! =
backen ds
st able
Ġf unction
Ġ You
tt ention
les s
Ġ ]
Ġw idth
o p
j o
feat ure
ç Ķ
ì Ħ
a ut
Ġlen gth
Ġconfig uration
Ġr ange
G ener
( **
d o
Ġc reate
D OC
v el
nam es
ĠH ugging
f n
ë ¥
de fault
sc ores
iz ers
" {
ctor y
ëĬ Ķ
Ġche ck
ab s
Ġco py
= {
Ġc or
Ġpro cess
Ġr el
res s
col umn
c ross
ith er
un et
ĠT ensor
, )
run c
j son
Ġc ross
ãĤ ¹
Ġp ad
= (
iel d
Ġt arget
Ġex ample
Ġ q
ud a
Ġ values
Ġ end
Ġw rit
A M
U T
ot h
à ¤
tensor s
ìĿ ´
p on
Ġp ipe
norm al
Ġs rc
p an
ex amples
[: ,
Ġ+ =
Ġspec ific
cl s
âĸ Ī
Ġn egative
U n
Ġl ast
[ [
ãģ ¦
t rans
Ġf irst
' t
vi ew
ãĥ «
Ġe ither
ul es
Ġf ol
M ix
ur r
l ip
p ipeline
c pu
Ġin ter
ran ge
se ed
. __
ptim izer
Ġs ample
ODE L
bo x
jo in
âĸĪ âĸĪ
m od
)? ;
ìĹ Ĳ
x t
ĠF lax
ì ļ
if y
Ġd oc
D iffusion
") ;
l ora
ar ge
T F
Ġp o
Ġrequir es
Ġs cheduler
Ġso ft
im g
ä ½
. {
Ġf orm
ed iate
Ġd iff
m an
Ġt r
Ġinst all
T orch
Ġdataset s
ĠT uple
fil es
init ial
Ġl atents
li ed
T ype
olut ion
doc string
Ġpr etrained
res ult
I S
PreTrained Model
Ġqu ery
] :
mpt y
ind ices
nd array
s um
Ġfeat ure
ì Ĭ
Q u
form at
Ġno ise
Ġt ask
im it
Ġlo cal
d ate
pp ing
um ents
Ġob tain
Ġs ame
Ġo ver
ww w
w e
po ol
zer o
c fg
Ġlo gger
RA N
as ed
etric s
fa ctor
u g
el ect
P E
Ġpro cessor
ff ic
O UT
Ġ Model
htt p
ãĤ Į
ë ¡
ind ow
urr ent
B lock
ãģ ¨
ë¥ ¼
ìĿ Ħ
Ġind ex
er ror
Ġ ðŁ
un t
w are
F OR
Ġd iffusers
con t
Ġor iginal
f ore
Ġ[ ]
wor d
Ġ kwargs
t al
oad er
l ast
p h
Ġo ur
Se quence
Ġsup port
c ript
pr ed
Ġma ke
th er
m ean
ãģ Į
m in
ãģ Ħ
ĠUn ion
us h
cceler ate
af et
â Ķ
docstring s
qu ery
i T
v it
Ġ height
ens ion
Ġp ath
Ġn ext
Ġpro v
ampl ing
prob s
F ace
Ġpr int
Ġpass ed
Ġp erm
form er
et er
ire ctory
Ġs ub
l atents
gener ate
t mp
ent ence
id ual
str uct
Ġtim e
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠ
( -
S t
t uple
Mix in
Model For
S cheduler
res net
s qu
pe ed
) ]
ì ł
pr ess
Ġan y
b s
Ġgener ator
Ġp y
ãģ Ł
ffic ient
V ec
f low
Ġì ŀ
ject ion
ĠA N
} )
ing le
Ġa ct
cod ed
c uda
ãĥ ĩ
() ;
l inear
Ġ %
qu ences
Con v
t arget
Ġa v
pa ce
pi pe
f l
g n
and le
y n
ĠWh ether
Ġ` "
assert True
Ġgener ation
re ed
po se
( '
ment ation
doc s
ĠC ON
Ġt uple
¤ Ĺ
Ġto p
Ġ arg
T ext
h f
pre c
M ODEL
MA P
Ġdiff er
ĠAN Y
L inear
valid ation
== ==
ãģ ĵ
Ġcon t
Ġfeat ures
. ")
Ġr andom
Model Output
d iffusers
ĠPy Torch
Ġp ixel
re am
C T
i a
n e
ĠR eturn
ĠG PU
} ")
o f
ĠHugging Face
Ġ` ``
Ġapp lic
s ub
swer ing
py right
extra ctor
W ith
Ġm od
ãĤ ¯
A n
A ttention
I L
e mpty
t ransformer
m all
d rop
w idth
ĠW e
ee ze
it le
Ġconv ert
b y
LI C
Ġr ight
c reate
L ong
at ic
ol der
"] .
çĶ ¨
Ġ[` ~
I TH
class ifier
cl ip
Ġ ro
re place
Layer Norm
Ġl imit
Ġlo gging
Ġfol low
Ġk ernel
orm er
ĠO R
Ġcon tain
a usal
d ummy
el l
Ġin to
tim esteps
off set
e poch
Ġb ias
ĠO F
Ġp ool
ãģĻ ãĤĭ
RA IN
pi ed
Ġex press
T uple
ust om
ĠI S
Ġ{ }
V E
it test
Ġ" --
ĠV ersion
Ġb et
ib le
gener ation
Ġinst ead
table Diffusion
er as
v ersion
Ġbu il
Ġm atch
Ġst ep
ä »
Ġg rad
Ġv ersion
Test er
DI TION
Ġapplic able
ç ļ
ĠW AR
param eters
k s
ol ve
çļ Ħ
k v
Ġwrit ing
Ġsoft ware
ST R
ãģ ª
ke ep
c ast
ĠA pache
down load
p ixel
Ġal so
EN SE
v ae
Ġc ode
ab il
Ġ z
iss ions
b e
o us
Ġp atch
Ġs ave
ĠA d
a pache
w o
Ġ ],
icens ed
IN D
å Ĳ
En coder
LIC ENSE
p ha
ãĥ¼ ãĥ
Ġla w
ult i
icens es
L icense
D ict
ĠP re
ĠB AS
Ġof f
TI ES
ĠWAR RAN
ITH OUT
Ġi ds
l icenses
Ġperm issions
ĠCON DITION
mask ed
ãģ ķ
Ġimp lied
ĠK IND
ĠWARRAN TIES
Ġreturn ed
Ġcomp li
Ġt emp
Ġdo es
Ġag reed
ĠCONDITION S
Ġcompli ance
__ ()
ĠBAS IS
ed u
un c
A uto
w rit
ĠT o
po p
gener ator
Ġg over
n umpy
p adding
ER T
Ġsc ript
ausal LM
C ON
mo ve
ar n
ë¡ ľ
Ġgover ning
s amples
ET RAIN
ĠRes ult
R es
Ġs u
Ġb ase
g uidance
Ġj np
ĠW ITHOUT
ex p
par se
Ġs ure
Ġgener ated
id ed
ĠCo pied
Ġd is
g y
Ġa ccelerator
} "
Ġex amples
Ġget attr
m ut
Ġlimit ations
Ġd es
b in
m emory
at io
un e
S elf
i ke
ETRAIN ED
Con d
Ċ ĉĉ
Ġ embed
ĠCon v
l d
Ġ X
pt ion
iv ation
od oc
aut odoc
our ce
Ġo ther
t e
FI G
l ate
STR ING
° Ģ
Ġì Ŀ
Ġform at
l ed
Ġm etadata
at ent
est ep
v ir
Ġca che
grad ient
l arge
n egative
mod ules
o og
Ġattention s
## #
b ject
de code
Ġs cale
Ġ) ,
initial izer
-------- --------
Ġ embedding
ĠA ll
âĶ ģ
r id
Ġstr ide
ol d
Ġdiffer ent
s d
squ eeze
lo gger
C ausalLM
sc ore
att en
Ġs plit
ent ity
com mon
extra ct
ĠReturn s
a ke
at al
oog le
ifi ed
ĠE x
f older
Ġc l
Ġtensor s
Ġstr ing
a udio
le ase
Ġt runc
position s
item s
Sequence Classification
Long Tensor
ì §
d is
Ġind ices
t ask
Ġw as
requ ire
. ,
âĶģ âĶģ
Ġ// /
mb ed
A T
") )
d ist
re ct
x iv
pr es
res hape
ve ctor
Ġcom m
Ġnorm al
a ges
N AM
Ġpre pare
T ip
et ri
g ress
b one
b it
Ġparam eters
PR ETRAINED
Ġf ield
res olve
l ong
Ġth an
zer os
n ext
Ġm in
DOC STRING
ar xiv
str ide
li b
vir on
ãĤ ¤
class ification
trans pose
Ġ heads
W h
b lob
: ]
es e
den se
Ġfil es
Ġh ow
Ġcon trol
_ (
c ase
a cc
s kip
c or
k ernel
T S
a in
ic k
iz es
ĠR e
N ot
Ġun et
.. /
¨ ë
at ing
is h
) `,
= -
Qu estion
a uto
ĠðŁ ¤Ĺ
Ġob ject
atal oader
f lax
t es
Ġw ant
= [
ec ut
yp es
Ġm o
conv ert
" ):
O bject
r ary
ãĥ ¢
ument ation
å ®
ob j
res pon
Ġh f
Ġp ub
n ot
Ġb o
. ",
dim s
un ct
Ġl ib
Ġd ropout
Ġc urrent
Ġ argument
Ġu size
m g
AR CH
Ġcomput e
Ġst eps
s cal
ĠCo pyright
CON FIG
ex ample
d a
Ġb ack
po st
" `
r andom
Ġ label
u ra
ãĥ ĥ
ĠF or
m eta
b ash
d iv
co pe
o pen
Ġf a
ist er
lo cal
Ġp art
Ġdown load
checkpoint ing
ĠD ataset
en code
on ents
ìĿ ĺ
ê ³
ca y
Ġ http
Ġmask ed
c ed
Ġd el
pr int
De coder
C LIP
Ġv ari
mbed ding
å Ī
ess age
rain er
e ft
Ġt itle
ä½ ¿
I VE
Ġgener ate
Gener ation
to p
ĠO k
Ġfollow ing
ĠA n
g t
L E
Ġa udio
f ter
h er
Ġpre v
Ġclass ification
Ġresult s
ARCH IVE
l ation
r and
bert a
qu ant
Ġcol umn
g pt
in s
ar m
test ing
Ġë ª
b ar
ut f
s rc
å ı
par ent
D ataset
token izers
Ġst d
ä½¿ çĶ¨
( *
L o
o id
æ ľ
et erm
if t
Ġo ptimizer
er ved
Ī ĺ
in ed
st d
Ġtr y
w ra
at ure
process ing
Ġcon text
el y
Ġ J
ide o
F ormer
tim m
re po
Ġl ike
`] .
p ert
o und
g en
ĠD ata
Ġd eta
] ],
ff er
m t
is ual
ãĤ Ĭ
V ision
s afet
ĠT ransformers
writ e
Ġj ust
à ±
Ġg lobal
chann el
ann ot
g lobal
f p
Ġa ut
t ing
ìĬ µ
Ġright s
ì§ Ģ
Ġm ust
P O
all el
f ree
al f
Ġpro b
wor k
S I
o ice
or age
Ġres erved
Ġper form
ĠL icensed
so ft
co unt
um ul
ĠUn less
er ies
um er
Se q
Ġapp ly
ipel ines
P r
it ect
Ġg uidance
ent er
V iT
pe ft
M ask
we en
put e
Ġa c
Ġspec ial
T his
umer ate
Ġe val
An swering
Ġa bo
" >
m ethod
! (
Ġt ra
Question Answering
h elp
P ING
: `
( {
Ġg roup
con trol
ix ed
l ang
ch unk
Ġst ates
o se
ãĥ¢ ãĥĩ
Ġsc ores
un ing
a p
Ġin ference
m ark
ĠM ask
Ġwh ere
f ram
m ents
Ġs ome
Ġo pen
Ġa x
up date
b eam
int erm
ï¼ Į
- >
Image Processor
MAP PING
Ġs ingle
Ġ error
con st
interm ediate
imp l
ction s
cl u
Ġre g
Ġ[ [
Ġimp le
Ġ att
Ġf alse
") .
en se
ìĦ ľ
Ĥ ¬
C o
Ġm emory
Ġe valu
Ġt wo
Ġprov ided
A rg
t emp
E mbedding
g oogle
Ġt mp
Ġa fter
¸ °
com m
ì ŀ
ext end
Ġf inal
Ġ ass
la ma
ĠI t
ĠAuto Tokenizer
Ġg iv
Ġs elect
cont ent
etri e
ĠE n
Ġa cc
ob ile
buil d
w ay
m ode
f irst
L A
[ `
Ġ keep
ãĥ¢ãĥĩ ãĥ«
r atio
iz ing
Ġs kip
log prob
' )
ĠC LIP
D ummy
Ġc ase
. """
w h
et e
m s
abil ity
re f
d ataloader
ãģĹ ãģ¦
F eat
he ck
Ġpa ir
For SequenceClassification
© ëĭĪëĭ¤
Ġre po
or iginal
? ;
Ġh ere
p ush
Ġparam s
ĠT raining
pres ent
Ġrequ ire
Ġma in
Ġcall back
it e
int er
f unction
Ġì ł
Ġm ultiple
" .
´ ë
è ¦
Ġ adapter
ĠD iffusion
P y
m etrics
ìļ ©
B ERT
in y
AR T
se g
ĠAuto ModelFor
) [
ck et
io us
Ġm ean
et ect
dir name
arm up
G PT
Ġlib rary
e ed
form ation
Ġëª ¨ë
ex pected
âĸĪâĸĪ âĸĪâĸĪ
Ġ arch
ch s
ĠI D
ist ic
c lo
Ġd on
pro jection
Ġìŀ Ī
Ġbet ween
ãģķ ãĤĮ
un ed
Ġth en
i an
ob ject
A L
Ġt rue
Ġen coding
s peech
gener ated
t ra
Ġen umerate
Ġto tal
add ed
predict ions
ĠS elf
Ġwor k
eterm in
A D
l r
íķ ľ
å ¤
ĠH ub
ãĥ¼ ãĤ
co py
f c
or k
it ial
ra w
ic al
meta class
x l
im um
y s
ht ml
Dummy Object
F ast
reg ister
A d
#### ####
wra p
) ),
ãĥ Ĺ
Ġn am
le vel
Ġwor d
att ern
Ġcor respon
s cope
o pt
s entence
on ly
l ine
Ġhas attr
]( ../
m ediate
group s
Ġ` [
face book
or der
Ġd rop
t ypes
w indow
el u
Ġqu ant
æ ĸ
Ġi gn
Ġax is
Ġs cal
Ġbe fore
le ct
w ise
Ġen coded
ire ct
u ff
c r
e os
H ead
itect ure
Ċ ĉ
Ġe ps
C E
Ġspec ified
C L
Ġpr ed
Ġde pth
R e
[ '
ver y
con text
t xt
~ ~
Ġcor rect
ìĬµ ëĭĪëĭ¤
C K
å Ĭ
on es
Ġres idual
Ġthe m
or ed
Ġin formation
fl atten
Ġre fer
Ġì Ĥ¬
Ġc od
í Ĭ
imp le
in et
s mall
Ġt yp
ar ed
ĠD ict
Ġgiv en
ĠS e
lo c
ĠL o
' ]
Ġtim esteps
s v
Ġarg uments
Ġit s
em ent
or d
ãĥ ª
ensor s
ul ary
Ġì Īĺ
l ator
ĠG PT
unct ional
low er
Ġ: ,
le an
] `,
rel ative
Ġ url
ĠĠĠĠ Ġ
ut il
n er
Mask ed
t ransform
m etric
r on
f ill
Ġg o
ä º
Ġm ut
w av
Ġth ere
r w
pa ir
m at
en v
le x
P ath
Ġf ine
Ġf ram
box es
no ise
clo se
A N
g pu
Ġs av
xt ra
Cond itional
ent ial
g ram
ĠS cript
ura cy
E X
ĠP IL
Ġadd ed
ert a
Ġtrain er
call back
a ccelerate
f ul
ãģĹ ãģ¾ãģĻ
Ġcl s
ĠT ransformer
viron ment
ĠS tableDiffusion
l p
r t
ãĥ Ĩ
ĠC lass
Ġre ad
e fficient
us ed
pro pert
ab led
íĬ ¸
Ġd en
ml p
Ġw arning
={ "
Ġw indow
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
pe at
ĠS ome
s p
com pute
å ħ
im il
ch ar
se quences
Ġ ent
į ¸
Ġex ist
ìĿ Ģ
imil ar
Ġt rans
ë ł
// //
ran k
ĠB ert
exp and
L O
ver age
Ġ íķ
ma pping
Ġ# [
s izes
de pth
Ġp l
ãĥ ©
clu de
u ous
Gener ator
Ġ $
by tes
un ittest
ate gy
n x
Ġ et
as es
ĠT eam
ë Ĳ
res h
s pan
) ):
ê °Ģ
al pha
il on
Ġrel ative
F lax
act ivation
en ch
U N
ur ing
Ġblock s
G E
ern al
è ¿
ĭ ¤
ob erta
Ġn on
length s
eps peed
Ġbuil d
Ġ channels
m atch
s ig
T O
s ampling
Tokenizer Fast
it ies
p ng
ĠB atch
ĠS t
ĠC heck
d iff
ase ModelOutput
Feat ure
umul ation
( __
. /
c ing
d f
æ ķ
re m
train er
Ġ array
U p
s ide
Ġm ode
Ġsupport ed
qu estion
Conditional Generation
st em
s q
pos it
ãĥ³ ãĤ
Ġt ransform
** **
fil ename
ĠIn itial
In put
p ipelines
} }
= _
Ġpre fix
T rainer
Ġtim estep
ĠIn d
P I
ast er
Ġse quences
E x
t iny
Ġt gt
res ize
ew ork
o ptim
ìĬ ¤
! [
Ġs in
tr ing
] ;
en able
m ul
Ġre move
L U
Ġëª¨ë į¸
) `
t rue
b le
d ump
propert y
Ġ( )
æ Ī
# [
h s
ĠL ay
ha p
Ġn umpy
Ġ ..
Ġde prec
Ġtest s
M E
to tal
n ect
For ConditionalGeneration
en coding
Ġg u
Ġpredict ions
st age
Ġb oth
ath er
f ull
Ġs d
q a
ãĤ Ī
Tester Mixin
ãģ į
d ed
ãģ Ĥ
X L
Ġal low
E xtra
Ġdef ined
Ġse cond
Ġinter mediate
edu ce
s umm
D own
sw ith
mb da
Ġpool ed
Ġch ar
Ġcod ing
P ar
p ub
test s
] [
"] [
in to
CH E
M Scheduler
un squeeze
config uration
est s
e v
" }
Ġse e
Ġe os
Ġ> =
etermin istic
ig uous
Ġqu estion
NAM E
Ġf l
Ġê ²
ĠTo ken
U L
ĠC an
Ġres net
man ual
For QuestionAnswering
sc ript
D P
Ġpredict ion
ĠN ote
Ġload ing
ĠIn c
b os
R E
y nam
s ampl
buil der
i k
ul ar
int ernal
ig h
ĠT h
Ġv ae
w arning
Ġtyp ing
s low
en den
Ġl ong
read y
Ġm an
Ġparam eter
Ġdim ension
Ġu int
Ġt ransformer
ĠC h
> ,
um e
ì ľ
e arch
u il
all close
predict ion
ab les
ĠìĤ¬ ìļ©
Un ion
p ip
ca use
D ata
Ġv er
ra ph
Ġj son
ê ¸°
Ġc ustom
off load
ĠP lease
Ġl ora
result s
A v
ë ĵ
Ġtrunc ation
u le
_ {
ĠF ace
LI ST
epoch s
s up
Ġc re
IN PU
Ġp t
ro und
lo gging
Ġx s
Ġp res
// /
(" --
um ber
comp onents
D ep
Ġ Ã
w armup
in k
Ġthe y
R L
C ase
Ġm at
pt r
Ġl atent
control net
Ġv ision
Ġt eam
m er
M S
h as
Ġs er
Ġconst ant
column s
yn c
Ġin stance
Ġra w
f unctional
A I
ight man
Ġinitial izer
I s
__ )
Ġnot e
Masked LM
Token Classification
Ġpa per
For CausalLM
Ġse g
Ġ: ]
Ġlo w
il ation
==== ====
m etadata
u x
c re
ìĿ ¸
u ally
Ġor der
o is
o ptimizer
Ġz ip
ign ature
un ch
ìĹĲ ìĦľ
T emp
Ġun ittest
r en
Ġal ready
ition ing
Ġlo ok
f inal
S peech
Ġ Q
Ġi mg
Ġtemp file
è¦ ģ
le ft
L e
t ree
Ġwh ile
tt n
F low
Ġav oid
struct ure
Ġselect ed
b eta
v ari
Ġj ax
li ke
Ġr ename
bu ffer
res olution
m ultiple
Ġe very
as on
y le
Ġcont in
) `.
C ross
I d
ãĤ ī
Test Case
Ġd uring
e q
Ġkey s
Ġc andle
ri or
Ġload ed
Ġl ine
è ¡
an k
Ġcon d
Ġmethod s
safet ensors
ãģ ĭ
pre v
Ġ row
bs z
ant ic
Ġre present
m d
íķ ł
Ġgrad ient
íķ ´
Ġ( (
Ġbo x
Ġav ailable
ãģĵ ãģ¨
:: <
pi e
normal ize
back bone
Ġp eft
fil ter
bu cket
S tableDiffusion
n b
est ed
ĠM ark
I f
Ġa ction
assert List
i or
t y
Ġl inear
Ġë °
INPU TS
ãģ ı
om atic
cat en
ë ¦
l anguage
Ġd set
ĠS ize
Lo ss
"] ["
un wrap
Ġabo ut
Ġk eras
i er
b ot
Ġse ed
Ġ} ;
) `):
iss ing
åĲ Ī
è ª
A B
ar row
assertList Equal
h or
Ġf ound
ri x
Ġdoc umentation
ĠU Net
check er
Ġm etrics
Ġsu ch
Dep enden
d m
Ġs ampling
ir d
ĠW av
Ġat ol
Ġo ld
im e
P A
Ġd s
d irectory
Ġun cond
Ġbe cause
ST ART
: ,
T ransformer
ool ing
With P
Av ailable
en cy
his per
Dependen cy
c ut
posit ory
Ġvocab ulary
cript ion
N e
P aram
d eta
íķĺ ëĬĶ
âĶģâĶģ âĶģâĶģ
ĠA l
Ġind ic
Arg uments
m id
ì ĸ
Ġtask s
Extra ctor
T E
ic ro
for ce
Ġfil ename
Ġle arning
Ġi ter
Ġ ad
Ġb eta
Not Available
Dependency NotAvailable
py test
D ropout
ĠOptional DependencyNotAvailable
ion ary
prec ision
b f
ut ure
L og
re peat
L P
Ġt able
rw ightman
g elu
ynam ic
D O
pa int
m essage
D ense
ãĤ ģ
Ġspec ify
R oberta
ex port
Ġprev ious
= ["
ma k
Ġ es
h ash
Ġm etric
F T
m em
Ġ à¤
Ġoff set
Ġ extra
f ast
buil t
â Ģ
sh ard
CHE CK
ĠA ttention
orm al
) ).
Auto ModelFor
Ġf ind
la p
str ategy
assert Is
ä¸ Ģ
j ax
Ġl r
Ġt rained
str ip
etrained Config
ĠInd ices
layer norm
j np
è ¨
ched ule
Ġf ree
cl one
Ġnam es
k eras
m m
le arning
Ġal pha
Ġd iffusion
Ġê °
s ource
íķ ©ëĭĪëĭ¤
cont iguous
ĠAn y
de cay
ĠG ener
pro gress
ãĥ ¬
Ġqu e
Ġpo ss
u es
Ġs um
il y
or ary
Ġm ath
ĠLo RA
r ng
Ġ ext
Ġd i
ur se
Ġre mo
ä» ¥
Ġs p
C h
Ġd irect
Ġcon s
Ġ vec
Ġen vironment
Ġmodel ing
Ġth ese
For TokenClassification
vector s
k y
Ġadd itional
w n
ãĥ Ń
Ġthe ir
PT ext
({ "
S eg
tmp dirname
Ġd ummy
c enter
Wh at
] ["
bu g
ug h
R O
LI PText
C om
Ġbe en
Ġo ptim
il ed
a it
Ġd st
patch es
Ġa ccelerate
** .
ch o
Ġwith out
m e
chedul ers
ĠT O
ĠP r
pp ed
) }
ĠC onfig
` )
Ġch unk
é Ģ
token ization
ds et
ok i
Ġs ig
Ġatt ribut
For MaskedLM
on nx
ag er
ĠP aram
Ġmax imum
ĠImage Net
de v
ãĥ³ãĤ °
C ho
G B
per mut
ecut ter
oki ecutter
f ct
Ġs pan
pie ce
Ġd irectory
ãĤ¹ ãĥĪ
ĠClass ification
Ġo ptional
trol Net
offset s
rem ote
en c
Ġ( [`
acc umulation
Ġe poch
a ccelerator
ì ĭ
ment ed
ate g
u ch
co s
mask s
de ep
pa ck
ĠS et
ĠìŀĪ ìĬµëĭĪëĭ¤
A l
Ġh uggingface
Ġv b
Ġid x
cept ion
A ttn
app ly
ar ange
Ġbe am
ãģ§ ãģĻ
Ġì Ħ
Ġup date
S tring
å Ń
ë ©
Ġf p
pro ject
ĠW eight
af e
Ġdeta ils
an s
ro ad
Ġmask s
C A
t s
m ulti
For Image
l atent
lay out
ä ¾
Ġcheckpoint s
res earch
ench mark
Ċ ĠĠ
at ial
Ġ) .
i qu
Ġs peech
qu eries
a w
Ġe v
ìľ ¼
ĠP ath
d istributed
ro ugh
qu ential
ca usal
s z
ìĦ ±
doc umentation
I T
L oader
eg at
ï¼ ļ
soft max
Ġa p
eps ilon
ãģ§ ãģį
s ingle
Ġ à°
Ġs afet
IN T
ìļ Ķ
Ġevalu ation
. <
Ġp la
ĠU se
at er
Ġ adapt
. *
ĠID s
pon se
Ġb est
r y
' re
t runc
ign ore
and ard
Ġst age
Ġpro per
der ed
Ġen able
! ("
ĠP ro
Log its
e qual
g s
w in
Ġde coding
pr ior
Ġmod ules
ı Ħ
re ak
Ġbe ha
road cast
W e
Ġca ched
Ġarch itecture
ĠMark down
way s
n ly
Ġ Z
eg r
i ated
dis able
l et
å ¿
ëĵ ľ
c rop
n ow
Ġus es
as ic
ĠC PU
M ultiple
ist il
ìĦ ¸
Ġm er
Ġh alf
pp er
g it
re move
Cho ice
( |
.. =
Ġ< =
Ġ` --
ĠN ormal
se e
Ġs mall
ĠN umber
sq rt
Ġgu ide
q dm
Ġch oice
B uil
c ul
n ode
ãģ Ĩ
ãĤĴ ä½¿çĶ¨
f unc
st atic
ol s
requ ir
j it
po lation
de epspeed
p g
Ġc lip
Ġre place
Ġcontin ue
" `):
Ġc rop
scal ing
Ġf ull
m y
Ġstr uct
ê³ ł
æķ °
ê ²
Ġclass ifier
Ġs entence
I MA
str u
c ur
er r
co okiecutter
Ġ channel
ãĥ ķ
Ġd eterministic
ĠL e
ĠU s
V alue
p attern
] `:
a c
à ¥
Ġ[ -
wor ds
permut e
B atch
Ġst ream
ter able
en gth
Ġ" .
Ġsc ore
Ġpo int
Feature Extractor
Ġ val
Ġê °Ģ
resh old
è¡ Į
ĠT ext
Ġcall ed
Ġm ulti
Ġre vision
im ent
ois ing
Ġ< /
Ġle arn
om ent
å ¾
Ġ extract
att er
Ġrun ning
Ġpo st
å °
Ġ ar
pl its
Ġ Ċ
is m
`] ):
Ġnote book
h alf
ãģ® ãĤ
start swith
å ł
an swer
Ġn ow
Ġcomm and
} ;
å ľ
Ġpres ent
rel e
¯ ¸
Ġë ĭ¤
NAM ES
å ĩ
è ¯
etect ion
Ġc fg
Ġcontain ing
p df
Ġma p
ĠTensor Flow
spec ific
Ġp ush
Ġpy thon
st ream
ĠT ask
Ġan swer
rit er
unc ased
D irectory
v ar
n ote
ress ion
D im
g l
x s
c ision
ĠC om
Ġsh ift
Ġcorrespon ding
f inet
Ġcontrol net
l in
orary Directory
Multiple Choice
> ",
ĠT est
p il
ĠA cc
Ġtoken izers
t en
st orage
B art
ho ok
c ustom
Lay out
ĠIn st
o v
ĠP ipeline
Ġa uto
() ?;
Ġsh ard
Ġprompt s
ìĸ ´
í ģ
oth er
O P
model name
s pace
PE CT
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
C ol
! --
( _
` ).
s ignature
---------------- ----------------
]] ]
' ll
vi or
l v
Ġp rior
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
pa ces
Ã ¼
í Ļ
Ġt ake
tim estep
be fore
Ġex p
") ]
Ġb reak
Ġw ay
Ġproper ly
r al
Ã ¡
Ġs amples
[: -
y stem
p ers
path s
load ed
å® ļ
W av
Ġ" "
point s
Buil der
m aster
Ġb os
Ġr etrie
ĠV ec
Ġdirect ly
e y
beam s
Ġsin ce
icro soft
Ġs lice
Ġb ased
Ġdict ionary
z ip
Cond ition
ĠParam eters
token ize
Ġwarning s
us er
Ġ... ,
Ġaut omatic
d es
Temp oraryDirectory
ë¦ ¬
EX T
Ġbatch ed
Ġb el
Ġmo st
in f
se arch
ãģ ¤
ist ant
PECT ED
Ġd iv
loss ary
j pg
ic s
ě [
åı ¯
re vision
pool ed
ĠS ie
< !--
] `
g rid
Ġth rough
)) )
a pi
l n
Ġpredict ed
Ġ Y
Ķ Ħ
æ ¨
Ġ validation
Ġe as
c urrent
ĠGPU s
ĠAd d
m ix
re q
Ġit em
ins ky
Ġprocess ing
ro berta
Ġ} )
Ġ_ ,
T h
le m
Ġcomput ing
g lossary
Class ifier
` ](
c am
and insky
i ed
l lama
cr ete
Ġs ource
co urse
ie ce
Ġì ķ
Ġposs ible
æĪ Ĳ
Ġr ate
Ġus er
Ġfa ctor
t uning
æ ³
Ġc apt
ro t
] `):
Ġid ent
uff le
åł ´
¡ å
Ġh y
al lable
ãģ ¿
egat ron
Ġ valid
Ġs ort
ĠĠĠĠĠĠĠĠ ĠĠĠĠ
{ {
/ >
Ġposition s
b art
Ŀ ¼
I G
Ċĉĉ ĉĉ
cho ices
ff ect
å ī
Ġh ub
apt er
ing s
Ġo pt
our ces
qual ity
col lator
e ar
Ġ zero
Ġd ist
Ġcomp onents
PreTrained Tokenizer
Ġv isual
ens ions
Ġimple mentation
ìľ¼ ë¡ľ
ãĥ¼ãĥ ī
odu ct
mak er
n on
Ġwh at
Ġprov ide
N N
s ure
ĠìĿ ´ë
b ig
ĠA r
tensor flow
DI R
åľ ¨
Ġsav ed
ãĥ ģ
age maker
ff n
] ),
Ġre pository
Ġca usal
v a
u f
Ã ¨
Ġlo c
Ġsh ow
Ġ est
m ath
is es
Param eter
Ġn ull
id es
ĊĠĠĠĠĠĠĠĠĠĠĠĠ Ġ
Ġsoft max
Ġset up
Ġinst ant
I D
Ġpre process
Ġign ored
Ġm id
åł´ åĲĪ
sh ift
ĠTO DO
la mbda
ĠAcc uracy
ãĤ Ĥ
à± į
l er
Ġs imple
res cale
ĠS table
F A
Ġcontain s
-- >
ĠO ption
âĸĪâĸĪâĸĪâĸĪ âĸĪâĸĪâĸĪâĸĪ
note book
and b
ãģĤ ãĤĬ
D Condition
ĠT op
st ore
w arn
Ġpar ent
b n
el lo
Ġwor ks
v ideo
Ġë ³
Ġtim m
~~ ~~
al cul
Ġo wn
l at
ed ge
ĠL oad
Ġ" \
SI Z
ForImage Classification
} /
Ġn et
v isual
at s
Ġvari ant
A nd
å Į
Ġor ig
Ġneed s
Ġdeta il
Ġs yn
h y
s elect
ĠT PU
ĠR un
ĠSe quence
ĠConv olution
cond itioning
il ing
ãĥ ¡
Ġst em
ĠìĿ ´
ĥ ½
Ġd one
ìł ķ
Ġarg parse
v ing
Ġin v
Ġì ľ
const ant
Ġst andard
ĠDe ep
ca ption
ê³ ¼
col lect
Ġle ft
s pect
sh ort
Ġì ¶
ë §
ĠDe fault
summ ary
Un less
/ ',
T raining
Ġs umm
requir es
p art
() `
ist s
Ġpro jection
ĠG et
Ġcomp at
af ter
Ġass oc
I mg
ãģĹ ãģŁ
Ã ³
safet y
ĠM obile
Ġbeha vior
load ing
Ġen v
aseModelOutput WithP
c ard
PO INT
oment um
D A
é ĩ
Ġs peed
em antic
ow er
Ġact ivation
Ġal ways
IMA GE
N ext
ĠB lock
ĠPy thon
Ġv ery
Ġpr et
gg reg
ë© ´
r l
ãģ ł
mat mul
Ġdeprec ated
Ġremo ved
c sv
Ġ) ;
Ġma pping
Ġl arge
Ġy ield
al ty
Ġh igh
) <
G PU
Ġh andle
Ġì ĥ
Į Ģ
ĠS o
o st
Ġë į
í Ħ
Ġch ange
A r
S peed
ë ²
Ġc lean
Ġo per
Pr etrainedConfig
ro gram
ol ic
-- -
ĠE r
Ċ ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
Ġs imilar
Ġgroup s
M ER
l ines
æ ĺ
Ġm ight
ãĥ ī
ãĤ ¢
ran ch
Ġì ĺ
FI L
ãģŁ ãĤģ
la mp
:: {
Ġac cept
Ġap pro
ì ķ
iv ely
us s
Ġre f
ĠWh en
f w
m as
av ing
ĠEx ample
] ])
Ġs low
un g
il d
par allel
b est
d p
m ixed
ad am
Ġst yle
PreT raining
ad a
Ġ( {
Ġcont ent
fram ework
s ent
to list
Ġa verage
() }
Ġpar a
Ġinstall ed
åĪ Ĩ
m icrosoft
st ack
ra pper
)) ;
or ding
Ġs ent
ìĹ ¬
M P
ãĥ ĳ
ĠD Type
form ers
ines e
Ġback bone
Ġden oising
rate gy
Ġ eta
iter able
' ),
s ha
Ġobject s
Ġabo ve
ĠInitial ize
Ġel ement
Classifier Output
Ġassoc iated
Ġc rate
data class
LIPText Model
> (
d el
il ity
ãĥķ ãĤ
p lay
Ġc annot
() ?
Ġre ference
pl ic
fram es
ak er
Ġdis able
Ġpro ject
For MultipleChoice
extend ed
c le
Ġis s
class method
//// ////
H ub
V I
g in
Ġë §
n s
em o
Ġdoes n
Ġautomatic ally
DCondition Model
ar ization
" />
? ](../
Ġin her
æľ Ģ
i ew
q kv
Ġt qdm
Ġw ere
Ġrefer ences
s m
Ġw ould
CL AS
UL T
r educe
Ġpre cision
ðŁ ¤Ĺ
ph as
St rategy
ŀ ĭ
ë Ł
ra ct
Ġfil ter
resnet s
D is
ĠAutoModelFor CausalLM
ax is
comp ile
a z
Ġc ur
un n
Ġset ting
Ġign ore
cam el
ann el
abil ities
] ))
on s
Ġpro gress
Ġal ong
ãĤĴ æ
Ġw ell
Norm al
ë ıĦ
Ġclass es
edict ion
efficient net
config s
Ġv ideo
ì ¹
finet uned
un cond
è ®
ãĤ¤ ãĥ³
deta ch
è ĥ½
Ġ entity
le ctions
ma ke
Ġí Į
Bert Model
ìł ģ
z en
pro c
p end
r ed
Ġm essage
In stance
temp late
å º
Ġp added
M T
å ĥ
od es
Ġc ast
ĠL ab
Ġres ponse
Ġle vel
" ;
` ],
Ġst ore
ver al
P iece
Ġfol der
åĥ ı
em ents
ĠC ode
A udio
er ature
Ġup d
Le vel
Ġf ast
Ġì Ĺ
Ġinitial ized
open ai
P IL
i ents
ĠH ow
sampl er
Ġm lp
th read
work ers
rele ases
th ing
param eter
v ers
í ĸ
Ġ` `
Ġneed ed
in ish
U S
dist il
bo ard
mp le
Ġde v
/ )
Ġ util
Ġe qual
Ġbuil der
Ġin fo
ĠT rainer
ãĤ »
Co pyright
Ġacc ording
bucket s
Ġbel ow
less M
T rained
er ial
Ġd ie
** ,
Ġ" <
Ġreturn s
ãĥ¼ãĤ ¿
Par ser
camel case
Ġ( :
Ġ[ ],
pr et
con cat
ver se
Ġ& [
Ġp lease
and id
c ent
ĠB y
in v
egr ation
æ¨ ¡å
Ġconvert ed
edu ction
Ġevalu ate
s in
ĠE fficient
Ġin clude
pr od
ĊĊ Ġ
G EN
T able
ĠS peech
"] :
ĠEx amples
Co mp
or ds
Ġd er
ĠPre Trained
p ct
Ġun k
ĠR o
Ġpass ing
CHECK POINT
e ach
r u
íĦ °
F F
Ġ quality
L icensed
De vice
######## ########
Ġtoken ized
StableDiffusion Pipeline
S ize
che ma
IN E
}. "
it ch
Ġre ward
ë Ŀ¼
Ġt ak
For PreTraining
ĠN ot
ãĥĨ ãĤ
B y
ĠM ODEL
A E
{ "
Ġ" __
FOR MER
Ġal t
Ġag ent
od y
Ġmat rix
Ġbox es
la g
Ġ[ '
ĠB ERT
ãĥ¼ ãĤ¯
tr y
caten ate
ãĥ¬ ãĥ¼ãĥ
t rained
or ig
Ġde code
ãĤ ¿
istribut ion
ĠRes Net
Ġcomput ed
en et
ĠF eat
e ck
¤ ĳ
us ic
hap ed
ì¹ ĺ
id er
Ġa b
all back
ĠS h
co gn
ãģĵ ãĤĮ
ãĥ ĸ
fl ash
æĸ ¹
U DA
Ġwh ether
oc al
Ġbe gin
Ġuse ful
Ġus age
Ġth ose
åĮ ĸ
Ġsafet y
å¿ ħ
Ġse veral
Ġet c
s imilar
ĠC ross
Ġbet ter
c ore
t len
CT C
p us
ar r
ãĥ §
Ġv iew
Ġco uld
AS K
tlen eck
s l
¸ ı
å Ĩ
ï ¸ı
ed it
il i
back ward
ãĥĥ ãĥĪ
Ĥ ĺ
Ġs ys
ĠB e
Ġob j
Ġtra ck
Ġb sz
Ġbe ing
ĭ ãĥ³ãĤ°
ig her
der ive
cess ing
task s
" },
est amp
d st
ad e
is y
c li
ro ot
Ġr ank
sor t
Model Tester
Res ult
s g
ĠA PI
co lab
ĠIn ter
wh ere
se m
é ģ
ur al
onf ormer
ign ed
En coding
ï¼ ī
íģ ¬
s chedule
la va
Ġex pect
ä¸ ª
æĸ ĩ
seq len
Ġpy torch
æ¨¡å ŀĭ
} ",
Ġf lax
Ġm ixed
Ġi l
ĠP R
ĠM ake
ca ched
Ġsh ort
sh ared
Ġpy test
Ġchar act
sup er
d b
ch oice
Ġcom mon
ë ³
el se
à° ¿
a a
é ĸ
ì Ļ
Ġse p
Ġlow er
Ġe in
Ġman y
b et
Ġl m
Wh ether
Ġdes c
ĠC reate
e valu
u int
Ġl es
ĠLay er
Ġwor ds
Ġperform ance
Embedding s
ĠDiffusion Pipeline
ç »
or ial
ìĿ ¼
Dim ension
åī į
ig B
ma gen
add itional
per iment
m ult
ï¼ Ī
Ġprob ability
igB ird
in clude
Ġc lo
Ġsig ma
FA ULT
unn el
up lic
ãģ§ãģį ãģ¾ãģĻ
å ¸
an swering
Ġ" ,
pre process
Ġfram ework
g ather
Ġc ell
un it
ave form
ãĥĪ ãĥ¬ãĥ¼ãĥ
v es
Ġc alcul
Ġmean s
R o
ĠN ame
SIZ E
ib ility
port ed
Ġcorrect ly
**** ****
D Type
Ġh and
pr une
Ġp our
lo om
ìĿ Į
C ODE
Ġrequ ests
Module List
D AT
down sample
æ ¬
ut orial
Ġf eed
Ġapp lied
ho to
ãģ¦ ãģĦ
L oad
{ '
å Ľ
u ke
ĠV iT
St ate
Ġê² ĥ
i ence
in ner
ãĤ ³
LM Head
comm and
Ġ emb
en g
b roadcast
ãģ Ĭ
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
Ġch o
process es
Ġobtain ed
pred s
et al
Ġla unch
sig ma
B e
t itle
Ġd ilation
Ġen code
nect ion
FIL ES
annel Dimension
row s
g ray
Logits Processor
ãĥĪãĥ¬ãĥ¼ãĥ ĭãĥ³ãĤ°
le ction
ĠB lip
ument Parser
tro py
ëĲ ĺ
i ver
w ait
ĠF ile
av g
OC AB
CL S
æ ŀ
un ity
ĠO r
olut e
Ġover r
ro zen
Ġ( '
un ding
ern els
([ [
ä¸ ĭ
I terable
En tropy
O M
f ield
Ġth read
Ġtoken ize
ãĤ¹ ãĤ¯
olic y
ìĻ Ģ
f s
Ġt a
Ġa bs
ĠE X
Ġpa ck
B lip
ãĤ ·
Ġres olution
Ġcomm it
Ġac cess
K EN
e f
x formers
sd p
] ):
In t
rel u
ol ver
Ġv ers
... ,
) ],
n own
Ġlo op
Ġindic ates
ëŁ ¬
e ma
Ġin fer
Ġg it
ĠRes idual
we ak
å¿ħ è¦ģ
n one
en viron
Ġ" `
Ġdo ing
DI MScheduler
g raph
æ ı
its and
å® Ł
assertIs Instance
Com mon
: <
F N
c ell
it ive
ĠP ooling
ĠLay out
B ase
X LM
m el
ex cept
Ġë ĮĢ
in st
ĠP eft
Ċĉĉ ĉ
ìĦ¸ ìļĶ
p ix
Ġs pace
se p
Ġ{ '
am ma
Ġsav ing
ut er
Ġr en
trans lation
Ġcolumn s
ĠInitial izing
itsand bytes
N o
con cept
f req
c d
å ¯
mo oth
ħ ëĭĪëĭ¤
ãĤĴ ç
Ġcomput ation
l ing
un ter
)? .
ĠÃ ł
åĬ ł
ra g
seg mentation
ded Token
Ġì¶ Ķ
d etr
Ġint eg
Ġ\ \
sw ers
ìĭ ľ
æľ ī
ĠToken izer
Ġsort ed
ĠíĮ Į
K L
h i
å ¼
__ .__
Ġse par
f eed
re ason
¯¸ ì§Ģ
ħ į
istil Bert
N D
reg ression
Ġtransform s
Y PE
] ",
a ug
m issing
th is
Ġfloat s
hap es
b box
h ot
p lo
Ġr ng
res idual
res ume
ê °
Ġc os
ãģ Ŀ
Ġpos itional
u ge
v is
ser ial
l ight
Ġpar allel
p ass
lic ing
O S
p ull
aut h
ĠĠĠĠ ĠĠ
Ġnormal ize
sentence piece
ir ed
U M
Ġmodel o
Ġv ar
os ition
Ġen abled
free ze
æ¬ ¡
i os
m k
ist ent
ä¾ ĭ
Ġp attern
batch es
Ġen sure
ìļ °
flow ing
Ġro und
len der
ĠO nly
Ġq kv
Vision Model
Ġg ot
Ġaut hor
ãģĤãĤĬ ãģ¾ãģĻ
Ġ vectors
ub le
li er
Ġfl atten
Ġnet work
c i
s afe
Ġl arg
Ġsub folder
Ġother wise
t une
Ĳ Ĩ
it es
ug in
Encoder Decoder
Ġnormal ized
ì ²
Ġla mbda
Ġev en
Dis crete
f ig
lect ra
åĩ º
ech n
De ep
Ġcol lections
ãĥ§ ãĥ³
Ġde coded
__( **
Ġne cess
cogn ition
or ies
ĠL ora
bo se
object s
Discrete Scheduler
h ere
Ġm ult
qu et
Ġinitial ization
Ġpl us
st ages
Ġk now
an y
Pr ediction
lender bot
" `,
pool er
ãģĵ ãģ®
ãĥĥ ãĤ¯
r etrie
Ġde pen
qu i
() [
Seq LM
Ġr atio
Ġex ecut
Ġquant ization
ļ ł
Ġsupport s
Ġtrunc ated
Ġpair s
Ġscal ing
c ased
Ġn b
Ġh ref
ta x
Arg umentParser
ggreg ation
Ġm e
PA TH
ĠB ase
nam ed
Ġí Ļ
am l
ist ral
ĠA ccelerator
ĠP adding
cl ud
Vision Config
ç ī
Ġ& &
PU T
Ġinitial ize
Ġcre ated
distil bert
el em
ĠC ol
pen alty
íķĺ ìĹ¬
Ġdoc string
Ġ he
ãĥ ŀ
Ġseg mentation
æ³ ķ
è ĩ
as type
Ġfor ce
nn x
Ġtarget s
ìĬ¤ íĬ¸
Ġd ynamic
th reshold
Ġtr ust
b float
f e
í ĶĦ
Ĥ ¨
s chedulers
ar ies
ou g
Ġìľ Ħ
I mple
c it
m ed
is ible
eg in
DE FAULT
ĠEX PECTED
f ine
g ed
cor rect
] }
Ġ Qu
am es
Ġattribut e
( \
j ust
ert s
Ġpro j
F orm
a cken
v els
ãĤ µ
Ġqu ick
Ġpool er
ãĤĪ ãģĨ
Ġp hoto
us ing
íķĺ ê¸°
Ġag ain
rand n
riter ia
Ġexp and
e ver
et s
ĠM odule
Ġcom bin
ho st
Ġsp atial
t le
v t
Ġr and
encoder KL
par ser
Ġcorrespon ds
Ġcapt ion
] ).
Ġle ad
íĸ ī
H ello
U Net
i ally
Ġf uture
Ġv ia
bos ity
Py Torch
ëĲ ľ
IG H
µ ¬
checkpoint s
ìŀ ħëĭĪëĭ¤
A ct
M obile
R I
end ed
prob lem
LM v
b ugging
st ract
Ġn ode
ĠìĿ´ë ¯¸ì§Ģ
s paces
t pu
ç ĲĨ
Ġh o
]] :
Ġt ypes
Ġst orage
Ġ``` """
Ġin spect
Ġì §
conv next
ĠCon trolNet
c lamp
al s
() );
Ġdef ine
ãģ« ãģ¯
âĶģâĶģâĶģâĶģ âĶģâĶģâĶģâĶģ
Ġs ign
Ġd u
Ġk v
fer ences
ampl er
ä¸ Ń
ĠLe arning
Ġs a
pect rogram
>< /
ãģ§ ãģ¯
ĠDe cay
Ġbu ffer
¦ Ĥ
Ġf inet
Ġp ip
ãĥ Ŀ
Ġhas h
ãģĻãĤĭ ãģĵãģ¨
as us
Ġin side
token ized
ãĥ ¥
u size
Ġm issing
ce iver
Ġel ements
ĠD DP
Ġco unt
ä¸ Ĭ
Ad apter
Diffusion Pipeline
lat est
Ġ" _
Ġre ason
Ġe ffect
tra ck
Ġsyn tax
p ed
ex ists
tr ast
D etr
x lm
ë Ĥĺ
Ġc ard
( ["
Ġse arch
Con trolNet
ch ine
opt ions
_ ,
Ġb ert
Cross Attention
Ġin cre
Ġpla in
å ½
Ġ vector
way ml
Ã³ n
H ugging
m n
t gt
Ġ ,
il t
Ġh igher
Ġgener al
A X
ck pt
ĠM ax
Pro jection
Ġtensor flow
¬ ¸
ä ¿
Ġo p
Ġe fficient
Ġê ¸°
Ġeas ily
) },
Â ł
ĠV ision
ìł Ħ
Ġ ?
Ġs to
if orm
æ Ĥ¨
Ġf mt
re ference
ex ecut
Ġwrit e
extra ction
ãĥĪ ãĥ¼ãĤ¯
çĶ »
ĠDataset s
iqu e
ut e
Ġr est
pa pers
h r
â ļł
Ġr hs
Ġp ers
over write
çĶ Ł
Ġgo ing
ĠStableDiffusion Pipeline
Ne o
W rapper
f lex
l ash
æ Ģ
am W
ãĤ §
ĠI mport
batch ed
iss ues
olut ional
Ġoff load
R un
ì ĺ
transform s
Down Block
` "
a pan
Ġt emb
to k
ĠL anguage
SE P
Ġver ify
Ġtak es
ãĤ ª
ĠL inear
ĠR eg
s plits
et ch
Self Attention
Ġtra cing
âļł ï¸ı
D X
c andle
(" .")
Ġno isy
b ody
ub ic
çĶ» åĥı
L lama
æ ī
de c
Ġe mpty
for ma
ãģķ ãģĦ
æ İ
en coded
Ġset Up
Ġdim s
íĻ Ķ
s licing
w andb
æ Ń
Ġ art
on t
requ ests
O T
Ġdoc ument
g a
r od
x x
å į
en abled
å¤ §
ĠLab els
Imple mented
RAN S
Seg mentation
Ġinstant iate
ìł ľ
Ġf ew
TO KEN
C pu
or al
Ġd istribution
re ater
ĠA s
Implemented Error
l t
Ġa ble
ĠD own
Ġpr une
Ġquant ized
Ġê² ½
ump rod
ord in
\ \
t wo
Ġg rid
Ġres cale
ìŀ ¥
_ ()
ĠPre pare
Ġdownload ing
Id entity
aseModelOutputWithP ooling
P ool
n v
st o
Ġ` '
pos ed
acken d
Ġp ick
ãģ £
Ġìł Ħ
ãģı ãģł
ãģıãģł ãģķãģĦ
R eg
ch at
GEN ET
l one
is match
iel ds
ĠX LM
qui val
c umprod
Ġs om
Ġb box
() ))
Ġdim ensions
wor ks
Ġprob abilities
:` ~
ic ubic
Ġë ¶
ĠìĦ ¤
ĠFeat ures
qu e
Ġí Ĩ
ĠAr ch
Ġview er
ı ¬
R GB
a ux
g or
> =
t ers
ess ages
W arning
to m
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ Ġ
fa ctory
SE Q
r ust
Ã §
re port
__ }
ess ion
ä½ ľ
ãģķãĤĮ ãģŁ
ĠNot ImplementedError
to ols
Ġse ction
Ġlength s
quant ization
char s
R a
Ġl ess
Ġh ard
ĠP ar
run wayml
l imit
ĠM DX
Ġinter n
ren dered
pattern s
Ar ray
' ],
i um
ë ª
Ġm y
up sample
Ġus ually
ĠSo ft
+ )
N ew
[ ...,
¤ º
· ¸
ĠP E
Ġperform ing
Ġhy per
ĠP atch
AM P
RE AD
ĠGener ation
dered Dict
Ġ annot
Test s
ãĥ³ ãĤ¹
ĠInst ant
Ġnecess ary
B o
d l
Ġi m
Ġìŀ ĳ
Ġext ension
ãĤ ¸
fix t
fo o
Ġnam ed
ĠWeight s
d ynamic
å ¦Ĥ
Ġreg ular
F ile
st and
re ward
Ġimp ro
Ġëį °
b asic
b egin
Ġf ix
Ġa cross
Ġl ines
Ġnormal ization
åĬ Ľ
Par allel
Cross Attn
b r
Ġl ang
Ġqu eries
R ead
ı Ļ
at o
ĠA ccelerate
ĠO NN
ver bosity
Ġwh o
ĠONN X
ç ´
Ġr educe
ĠO pen
eg a
Ġattribut es
ist ory
ĠP er
Ġì ĸ
ãĥ Ĳ
Ġì ĭ
ĠTF AutoModelFor
Ġprocess ed
arg max
ĠA udio
ff ers
CrossAttention s
andid ate
ili ary
apan ese
at us
ro s
Ġd ir
Ġm uch
ãģ Ľ
ãģĮ ãģĤãĤĬãģ¾ãģĻ
ic ial
Ġse em
Ġì ĭ¤
trunc ation
p added
ì Īĺ
static method
W AR
Ġc at
Ġal ign
act ive
Ġëª¨ëį¸ ìĿĦ
C allback
g er
Ġb ig
la unch
ĠA CT
ĠC LIPTextModel
EN D
åĲ Į
Ġscript s
Col lator
S h
Ġt weak
co ords
Ġpred s
ĠPipeline TesterMixin
èĩ ª
gor ith
c s
è ¾
ot tleneck
ãĤ ĵ
Ġst atic
Ġdownload ed
M B
__ ,
ãĥ¼ ãĥĪ
normal ized
æĺ ¯
C ode
f ind
Ġsh uffle
Ġb enchmark
ãĤ ¨
à° ¨
Ġcont ribut
g u
l ish
Up Block
mer ges
Ġcond ition
c ateg
æ Ŀ
ar Builder
cod ers
Ġun a
ĠAuto Config
b l
Ġs cope
Ġre comm
Ġrequ est
sw in
M ax
æ Ľ
Ġo ption
Ġg en
pr oduct
ĠS D
w hisper
Ġp ipelines
Ġsh ared
summ arization
Ġ â
Ġs ystem
ãģĤ ãĤĭ
E IGH
s agemaker
} '
re ferences
ãģ ©
__ `]
Ġcall ing
] `.
Ġb in
__ ":
comp at
æĸ¹ æ³ķ
) ])
Ġ" [
ĠD im
CLAS S
ãģĭ ãĤī
Ġdata classes
ãĥĩ ãĥ¼ãĤ¿
ĠNormal ization
c an
Ġ Ã©
pl us
angu ages
ev ant
framework content
Training Arguments
ĠEr r
d ilation
ì ĥ
prompt s
Ġrel e
assertIs Not
Entropy Loss
al low
scal ed
èª ŀ
L OC
b lip
s n
Ġ um
Ġc pu
requ ency
ãĤ¤ ãĤ
PA RA
æŀ ľ
ĠO ne
Ġvers ions
d le
s chema
id ing
ur s
ir seq
Ġstart ing
cur s
St orage
cor d
åħ ¥
vari ant
Batch Norm
des cription
backen d
ãĥĹ ãĥŃ
Ġgo od
Ġfram e
assertIsNot None
M ASK
ĠA ut
C onformer
est ions
T ransformers
Ġallow s
Value Error
. )
ãģ Ī
OR T
G roup
m ultip
Ġto o
ĠIn put
ari an
Ġback ward
Ġiss ue
ì ¤ĳ
__ .
ire ction
In fo
predict or
ĠCLIP Tokenizer
ĠPE FT
r est
ë °
Ġd ataloader
ĠU p
ser ver
Ġëĭ¤ ìĿĮ
qu eeze
end swith
iv es
Ġinitial izing
c lean
Ġp olicy
trast ive
M ult
S plit
c rate
r ic
Ġweight ed
íķĺ ê³ł
ãĤĴä½¿çĶ¨ ãģĹãģ¦
ĠArch itecture
S ON
y mb
Ġs pectrogram
us ion
ãĥ¼ ãĥ«
Ġstring s
erial ize
Ra ises
c cess
Ġres ize
Ġdown sample
OUT PUT
e RO
paint ing
ä ¼
æ ¸
Ġde epspeed
assert Raises
N E
m obile
n Ã©
Ġa ux
ĠA verage
ĠL et
à± ģ
ê² Į
c ity
id ent
re p
Ġma chine
ĠN e
Loader Mixin
h and
n an
ĠM omentum
ites pace
ç Ľ
Ġd uplic
Ġp e
Ġs chedule
Ġde cay
ml m
Ġerror s
comm it
forma ble
]( ./
ĠDeep Speed
B A
w ik
é ¡
íķĺ ìĦ¸ìļĶ
Ġimple mented
åŃ ĺ
ĠImport Error
O p
le arn
mo st
Ġup load
stru ction
w i
Ġ extractor
on ent
Ġbatch es
I t
r odu
å ĭ
Ġ" $
") )?;
Ġtoken ization
Ġon ce
MA E
Ġscal ar
Ġupd ated
am ed
Ġrel ated
ĠResult s
å° Ĩ
w er
x la
Ġ adding
al phas
Ġin clud
() ),
bo oth
ream booth
ĠTraining Arguments
depth s
======== ========
Ġadapt ers
o lo
Ġt ag
ar se
ad o
Ġpos itive
Ġle ast
Ġdes cription
loc ation
O nly
S win
ot ion
Ġex act
In ter
Ġinher its
b ased
Ã ¶
num ber
`. "
DI A
å¸ ¸
Ġl ink
acc uracy
sp atial
åı¯ ä»¥
Ġf ill
le vels
ĠA pp
Ġdo g
Ġmod Ã¨
Ġìĥ Ŀ
De berta
ĠTask s
ìķ ¼
Ġan other
h et
ĠConfig Tester
EIGH TS
< '
ĠĠĠĠĠĠĠĠ Ġ
Ġres ample
Ġpar se
SI ON
Ġlarg er
oug h
Ġê²½ ìļ°
t uned
f sdp
y aml
ist ep
Ġre al
etr y
VI DIA
ĠEfficient Net
magen et
N G
ĠS E
]( #
app ing
n dim
Ġ layout
an ges
ëł ¥
Ġopt ions
Ġìĺ Ī
P s
(" .
ta gs
ãĢģ `
âĶ Ģ
ãģª ãģĦ
ĠCross EntropyLoss
LMHead Model
st ability
], )
ĠN o
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
Ġë° ©
P ix
an ces
ĠL ong
Ġres ume
)? ,
pool ing
dist ance
iqu es
Ġ"" ",
= $
De bug
ĠAd dedToken
S C
v q
Ã ¤
ì Ľ
Ġs imp
Ġin ner
ĠT ype
ens ional
,) `,
O r
Ġro t
quant ize
short cut
æĢ §
P er
Ġm sg
Ġimport ant
ĠM etadata
run ning
à° °
man ager
ë§ Į
mooth ing
Ġre m
ĠI MA
Ġun it
ĠM etrics
ized String
Ġact ual
è¿ Ļ
in ing
ip yn
ud ent
Ġvari able
ipyn b
ķ Į
Ġb it
sem antic
o ps
w l
ç ½
ig ram
reg net
mer ge
f b
l ete
to l
com put
s chedul
Ġw armup
ul ly
Ġtext s
ms g
oc s
erm ark
ìĿ´ íĦ°
ĠTh ese
ordin ates
ĠìĥĿ ìĦ±
h u
Ġp ix
Ġno us
ĠUn i
Ġí Ľ
be it
åº ¦
N ote
st yle
Ġw aveform
um an
ass istant
ist ency
ĠO ver
ĠH ere
ĠX L
x m
at ermark
and as
ĠC allable
Ġex periment
writ er
) ",
s ys
Ġd etect
ĠF LO
eth ing
Ġeps ilon
Img Pipeline
ãĤĪãģĨ ãģ«
(" /
ĠP a
Ġun d
Ń ãĤ¹ãĥĪ
re al
ur ther
text s
Se quential
ãĥķãĤ ©
d eterministic
Ġp ort
à° ¾
Ġí ģ
re at
ES S
inst all
O pen
ic ally
la ub
ers ation
"] ]
âĸ ģ
Ġwrit er
Ġrow s
Ne X
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠ
Ġaccept s
ãĥĨãĤ ŃãĤ¹ãĥĪ
pe aker
Ġb ranch
ĠC UDA
ĠS eam
tim estamp
Ġrepresent ation
ĠInter polation
M ap
Ġlong er
~~~~ ~~~~
S entence
Ġf x
Ġh aving
ĠS tring
rid ge
åı Ĥ
ns fw
ĠOr deredDict
ĠCol lection
ĠSeam lessM
, ),
L ike
o ken
è §
param etr
Ġch ang
à¤ ¾
Ġover write
Ġprocessor s
Ġpart ic
irect ional
U RL
V is
Ġm ultip
Ġst ill
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
ind s
log it
get her
Ġê ³
sig mas
laub ert
Ã Ń
code book
Ġj ob
Ġoffset s
Al bert
L ora
b ut
]) ;
Ġcol or
ìŀ Ĳ
u on
w ar
ar s
Ġw ra
ĠS win
ĠW ill
Ġno qa
Se arch
ack bone
inish ed
ë ¶
Ġpath s
éĢ ļ
sto pping
C allable
V ER
½ Ķ
im iter
ol ved
de prec
th ed
ĠG roup
mat rix
ãģ ĳ
con ds
pa city
requ est
E lectra
T RANS
ä ¹
æ Ĺ
att ribut
Pro cessing
ĠAuto Processor
read thed
span s
readthed ocs
p ick
t il
Ġs izes
al id
od al
Ġon nx
ĠV AE
pl an
ser ved
po th
ĠAuto encoderKL
Ġcond itioning
ç½ ®
se cond
to ol
adapt ers
Pipeline Output
TE ST
Ġpix els
m os
ĠC rop
æľ ¬
ãĥ¢ãĥĩãĥ« ãĤĴ
diff er
rot ary
stability ai
ì ħ
ro py
Ġcomp let
Ġexist ing
s ync
ĠL lama
ĠI N
res haped
Ġtrain able
with out
? ",
T EXT
c u
ĠB aseModelOutput
point er
lex ity
Normal izer
ĠFLO Ps
U s
r atch
Ġc u
Ġ" ",
Ġmodel lo
Ġre main
Ġre port
Ġv ous
Ġstr ategy
ĠData Loader
Ġtmp dirname
ord Piece
ME AN
Ġsmall er
echn iques
e in
Ġs plits
ion e
Ġc t
ĠH idden
etri eval
Ġdepth s
shard s
ul er
Ġma k
Ġab stract
V A
b log
in ally
Ġth reshold
ĠG oogle
seg ments
äº Ĩ
a il
f alse
§ ĭ
Ġreg ister
Ġ extended
ĠO utput
Ġy s
çī ¹
r is
Ã £
and o
de berta
ĠP ct
tensor board
processor s
tr ust
Ch annelDimension
notebook s
d uration
Ġt erm
po late
Ġv s
layer drop
act iv
mo id
C O
v ation
ĺ Ĳ
Ġm el
pt ions
ĠM ulti
à° Ĥ
ĠK andinsky
Ġbu cket
Ġìĭ ľ
> "
S H
f it
Ġ` .
ĠH f
AS ET
Ġcol late
Ġident ifier
Ġbegin ning
P rop
U B
a u
Ġ ãģ®
Ġ edit
ing er
Ġf aster
Ġn ested
ĠP art
Ġsuper class
vis ed
AMP LE
D Model
å ĳ
Ġ ãģ¯
Ġs afe
Ġf lag
Ġì ²
bu ffers
over flowing
iter al
Ġac count
Ġfl ash
âĢ Ļ
Ġcons ider
ĠCo mp
Ġta ken
/ .
g uid
im al
mask ing
ram e
ĠTh ere
nnx Config
ë ¸
ĠI s
fa il
Ġpre processing
Ġê° Ļ
åı¯ èĥ½
ga cy
gorith m
P lease
g an
pe x
Ġex port
ĠW ith
ĠE ach
over lap
ãģķãĤĮ ãģ¾ãģĻ
xm ert
d ot
i Ã³n
l ink
n ie
Ġ ãĤĴ
Ġt i
Ġde c
ĠS w
pl ugin
Ġsumm ary
Ã£ o
Ġt ri
Ġs ur
Ġ" /
ãģ ³
ta g
EN T
sh ot
cond ition
Ġprocess es
AM E
chunk s
í ĺ
in force
Ġp ot
Ġpr odu
PR E
Ġmer ges
Ġcompat ibility
o coder
s ame
ì Ĩ
Ġs chedulers
ĠC lone
Model ing
eg asus
li es
Ġz u
ĠìĿ ¸
respon se
ä¸Ģ ä¸ª
K ey
h id
y our
è ©
mp s
Ġto gether
ag ent
Ġform att
Ġfa il
Ġpla ce
* .
< ()
F O
Ġb ackend
ĠP osition
Ġdata class
Ġvari ables
evalu ate
ç µ
ç İ
ĠS eg
Ġnum er
Ġë ĭ
Ġcurrent ly
è¨ Ģ
ç ¤º
es h
Ġc onf
Ġf unc
Ġde vi
ST D
ãĥ¼ ãĤ¹
ä¸ º
abs olute
b pe
ex act
ãĥ Ļ
Ġsh util
Ġfunction s
Ġpart ial
BERT a
sampl ers
Ġcho ose
çĶŁ æĪĲ
S tr
U R
g amma
as ync
Ġa wait
ĠR ead
ãģ¾ ãģŁ
rand int
} :
Ġr eduction
Ġl ater
Ġconfig ur
Ġwor ld
normal izer
: ?
N ow
a ps
y ou
Ġp u
ĠConv ert
Ġinteg er
> )
c p
Ġc enter
ĠD DIMScheduler
squ ad
ĠEx ception
Ġtrunc ate
b rid
å Ģ
S emantic
ë ŀ
Ļ ìĬµ
ĠT YPE
ĠD istributed
ĠD iffusers
ĠB art
clu ding
Ħ ı
Ĵ Į
Ġ{ {
åĨ ħ
Ġìĭ¤ íĸī
<() >
k andinsky
Ġm on
res et
con s
ĠV arBuilder
Ġloss es
ãĤĪ ãĤĬ
hor s
L ab
f r
o o
on al
Ġb roadcast
Ġrel evant
å¤ ī
Ġsimp ly
W hisper
a ff
m it
al ign
ĠT rans
ĠC ustom
Model TesterMixin
ãģķãĤĮ ãģ¦ãģĦ
Ġretrie ve
å ĴĮ
in ce
Ġl anguages
pr uned
ĠĠĠĠĠĠĠĠ ĠĠ
Ġs l
ãģ ¹
** :
Ġgener ic
optim ization
Ġstruct ure
iling ual
Ġcompat ible
inger print
Ġto ol
ct x
str ided
con catenate
ĠD ropout
par quet
ãĥ³ ãĥĹ
layout lm
ë² ķ
Ġsent ences
V IS
b ad
r ices
¡ °
Ġoptim ization
{ %
æ Į
Ġy et
ĠW hisper
Ġí ħ
er o
ri end
ĠE ng
predict ed
quant ized
Ġìł ķ
å¤ ļ
A s
T rans
\ .
Ġs top
ĠIn ference
ampl ed
Ġgrad ients
Ġcomm unity
ãĥ¢ãĥĩãĥ« ãģ®
() ]
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠ
ĠI terable
With Projection
Ġìł ľ
vari ance
ĠPr etrainedConfig
F ound
Ġs ignature
Ġs emantic
Ġm it
// !
Ġe ar
Ġë ²
ag ing
âĸĪâĸĪâĸĪâĸĪâĸĪâĸĪâĸĪâĸĪ âĸĪâĸĪâĸĪâĸĪâĸĪâĸĪâĸĪâĸĪ
each er
Ġsa id
Ġwho le
d reambooth
p ing
oc o
ĠR oberta
Ġë Ķ
Ġro ot
Auto Tokenizer
t i
Ġc ar
() ).
ert ain
Ġg ive
Ġimport lib
B igBird
h igh
r s
Ġs qu
Ġd ark
is file
if act
runc ation
Ġa pi
Ġbo unding
æĽ ´
C fg
P a
ĠĠĠĠĠĠĠĠ ĠĠĠ
Ġì Ĭ
ĠK eras
CHECK ING
ĠCom pute
Ġshift ed
éĩ į
: -
P TION
t ie
th eta
Ġmatch es
long est
nect ed
Ġmer ge
az y
å®Ł è¡Į
" \
d d
y m
Ġp ur
ĠC ho
ĠS plit
DI M
Ġca p
Ġtemp late
Res ampling
EX PECTED
Ġarray s
Ġser ial
Ġsafet ensors
//////// ////////
arr as
bet as
parametr ize
Ġ utils
at om
Ġ_ :
par ed
reed y
ä»¥ ä¸ĭ
Ġëį° ìĿ´íĦ°
T ower
ãĥ £
ĠM B
Ġjust ify
Ġ ke
Ġ íķĺ
Ī ëł
ast ic
AT CH
Ġver bose
ĠPreTrained Model
schedul ing
u ation
en ding
ch en
Ġm ark
Ġb l
ma z
Ġth ree
ĠR ep
ĠG lobal
PARA MS
R UN
å Ł
co unter
Ġ| |
Ġconv olutional
Ġvari ance
uture Warning
Ġintern al
ĠmodÃ¨ le
C heck
H F
o x
ic ode
ot al
Ġg raph
Ġ} );
Ro Former
le ave
ĠG it
ER S
cos ine
v p
un iform
Ġg c
ĠL og
Ġcon caten
Ġbet as
Ġmat rices
Ġepoch s
pend ent
ridge Tower
L D
ro le
ro uter
Ġstr ength
ĠU RL
Ġlog s
Text Config
N ame
Ġ% (
temp erature
Ġtrans lation
Ġcharact er
ĠLora Config
S hape
V OCAB
b el
in line
Ġ' {
sh uffle
è¨ Ń
Ġë³ Ģ
Ġdevi ation
ce il
)) ?;
ĠAuto ImageProcessor
sd xl
stru ctions
< _
A G
M L
h ow
al loc
an h
Ġl hs
ĠIn t
sh ow
Auto Model
Res Net
lib rary
READ ME
compat ible
train able
ãģĻãĤĭ ãģŁãĤģ
Ġad just
ãĥĪãĥ¼ãĤ¯ ãĥ³
' `:
D etection
O TE
Q A
b itsandbytes
i magenet
Ġd ue
Ġ( -
iffus er
Ġí ĶĦ
Text Model
gl ue
dp m
- {
. **
s hapes
ent e
Ġê µ¬
Ġimple ment
Neo X
n ull
ç ķ
Ġm em
ãĤ °
wh ich
Ġdiv isible
Ġìķ Ĭ
Deep Speed
ĠíĻ ķ
ĠíĨ ł
Ġpartic ular
t on
Ġc e
Ġ[ {"
ĠD is
OR CH
ãģĹãģ¦ ãģıãģłãģķãģĦ
Ġíķ ©ëĭĪëĭ¤
M ake
Q U
b loom
æ Ħı
iz z
Ġg ather
Ġy ear
bin s
ãĥ¼ãĤ ¸
an ced
an swers
Ġc sv
Ġb s
Ġ( [
() ):
ãĤ £
ĠS ave
Net V
ëĬ ¥
Ġoff icial
sup ported
DAT ASET
D istilBert
k ernels
s r
Ġ edge
Ġre pr
"] ),
Ġv oid
Ġby tes
wor ld
scal es
( ())
M LP
} _
ĠModel s
ap as
ĠìĬ ¤
R andom
v b
Ġ ãģ«
Ġst able
Ġre peat
Ġun e
sc ience
ä¸ į
ä½ ł
Ġtemp erature
ĠRe qu
Ġrem ote
D o
M in
f x
f use
m egatron
t ual
Ġr edu
im ation
im odal
Ġh el
ob il
tain s
comput ed
as se
Ġc uda
ert ed
li ent
Ġav g
ĠSe q
Ġdeprec ation
deta ils
lv p
í ı¬
embed der
). __
Ġë ķĮ
fram e
Mult istep
obil enet
Ã ª
Ġs w
al con
Ġf ixed
Ġ" ")
Ġpr oduct
Ġtim es
Ġch anges
Ġuncond itional
Int egration
M aker
V ideo
b as
al bert
ĠB uil
ĠN VIDIA
In d
Ġcheckpoint ing
åŃ ¦
Ġ\\ (
Ġsom ething
l s
ct c
Ġst ored
`] :
MA X
) }")
E fficient
S R
b ranch
c ies
f mt
or s
ãģĦ ãģ¦
Ġfram es
ãģ£ ãģ¦
Ġë°© ë²ķ
s uch
å ¹
Ġc r
emb ert
(" \
Ġunder stand
Re f
AB LE
plic it
L et
p at
p lexity
us r
de pendent
age Maker
ĠRes ources
emo ve
wl ViT
C I
n odes
t ri
or ing
st op
ĊĊ ĠĠ
ĠN um
prob ability
ĠAd apt
CA TION
K E
in ator
Ġs q
com b
Ġpoint s
ĠìľĦ íķ´
g o
æ ł
Ġs end
Ġs ampled
Ġ" -
pe g
pre fill
Ġint rodu
Ġj o
dis k
Feat ures
äº ĭ
trunc ated
F E
L azy
V it
Ġc are
id ia
Ġde ep
emb er
conv s
Ġweight ing
Ġ< <
Ġ. /
Ex amples
med ium
multip lier
NeX t
L at
N umber
c f
Ĥ ´
al ity
ch inese
la ce
Ġl ik
=" <
}. ")
Ġdiffer ence
ĠLayer Norm
Ġsto pping
C annot
H E
P S
Ġc ateg
ĠD es
Pre Tokenizer
Ġact ive
Ġscal ed
Path Like
Ġexist s
æı Ĳ
Ġho ok
> #
T ime
a ction
im es
Ġres ized
ĠAuto Model
ãĤ» ãĥĥãĥĪ
ĠIMA GENET
il inear
ĠF S
Ġprob lem
Ġpl an
Ġfree ze
uss ian
Comp Vis
æ¬¡ ãģ®
T PU
r at
ch ans
Ġex pen
Ġcl one
seg ment
ĠAttention s
Ġcharact ers
Multistep Scheduler
g p
n ested
Ġ attr
ãĥ³ ãĥĪ
St ream
Lo gger
And CrossAttentions
EncoderDecoder Model
b nb
Ġc ases
str ength
Ġal phas
Ġíķ ĻìĬµ
Ġì§ Ģ
Ġsign ific
Ġannot ations
ensional ity
t ed
t ar
ç §
Ġ put
le ar
am b
Ġl at
Ġre gress
ĠS elect
are a
ĠF utureWarning
Ġsc ratch
: ])
L a
Ġb f
Ġdef ining
For CTC
ëł ¤
c ro
p b
t ied
é Ŀ
assert Dict
run time
Ġatt end
tra ce
oken ized
P ER
T v
Ġb nb
la ion
Ġres izing
ĠG uidance
Ġ`( {
Ġevery thing
íĻ ĺ
Ġoper ation
ND MScheduler
BA CK
assertDict Equal
n t
av ed
etermin ism
s pa
Ġ er
Ġne ver
Ġout side
Ġí ĺ
ĠRun time
d etection
Ġ ~
ĠD ummy
Ġj it
ĠCh inese
ein sum
maz on
C uda
i ou
s uff
ë Ķ
Ġd at
ĠA ss
Ġma ps
Ġkey word
ãĤĭ ãģĵãģ¨
LA X
M y
b enchmark
« ĸ
è «ĸ
Ġto k
cod es
emb d
ill ation
Pre LayerNorm
Ġ{} ",
ĠRe LU
ĠCho ose
B aseModelOutput
Ġb icubic
am lessM
up er
AS T
tr l
iter ator
PE FT
æĸ °
Ġoptional ly
S W
Ġc ro
() [:-
Ġ[ (
de bug
}. {
ìĿ´ íĶĦ
fig caption
: ],
M ode
è Ģ
Ġf ully
Ġa m
us oid
Ġpath lib
éĩ ı
sent ences
Ġdesc rib
ĠAut hors
i ating
lo op
ma ps
(" ./
log in
rg b
Object Detection
ins ert
FORMER S
Ġd as
ĠM apping
Ġmo ck
Ġregress ion
/ {
c v
} >
Ġs agemaker
Ġc andidate
Ġr tol
mo ck
arch ive
Ġprov ides
ĠìŀĪ ëĬĶ
ĠSpeech T
elem etry
H ow
x ies
æ Ĭ
Ġ ě[
Ġsh are
ãģĻ ãģ¹
Ġmod ified
Ġdeprec ate
Ġar ound
VIS I
list dir
Ġcall s
Ġpatch es
ãĤ¿ ãĤ¹ãĤ¯
e b
k l
n ers
p po
} \
é Ļ
Ġd Ã©
Ġw ar
im ate
po lic
ĠD P
pl at
fil ters
Se amlessM
Ġpo inter
Ġreg ion
æİ ¨
ãģ¾ãģŁ ãģ¯
us age
ĠB PE
ĠData Collator
ĠEn code
ëĿ¼ ìĿ¸
polic y
O nnxConfig
P Y
S ome
W EIGHTS
s lo
as ing
Ġconv ersion
Mix er
Ġcode book
ain Layer
Ġfl at
éĸ ¢
Ġoverr ide
serial ization
M ulti
| >
ent ropy
vel op
K V
M O
b ers
ĠA I
Ġth ings
ool s
Ġadd ition
Ġinter polation
Ġretrie ver
Lab el
Y P
g ml
r eduction
} `
é ¢
ĠS ample
ĠF lash
ĠR E
ĠH ash
Ã© r
ãģĹãģ¦ ãģĦ
******** ********
execut ion
) ["
I C
V i
å Ļ
Ġt ied
and s
ĠN ew
Ġup sample
ĠDe coder
Ġìŀ Ĳ
deep copy
ĠZ eRO
Ġiss ues
inforce ment
Ġd ense
ãģ °
Ġwith in
ĠB igBird
com e
script s
éģ ©
è¨Ń å®ļ
s es
y u
en e
ch ild
Ġde bugging
ri es
ĠF ast
Ġì °
Ġë ©
Ġact ually
Ġbuil t
íķ´ ìķ¼
Read er
suff ix
* )
load er
ta p
ìĹ ħ
äº İ
Ġhy poth
Ġdepen den
S et
d pr
g ent
ãĤ ı
ĠS ince
Ġcon cept
ĠE mbedding
aseModelOutputWithP ast
quival ent
curs ive
P eft
S ee
pe ak
ĠD PR
TI mage
ĠJ SON
big science
()? ,
CODE R
F rame
g pus
é ħį
Ġw on
up per
ri v
cal ing
Ġan swering
Ġass ign
åĭ ķ
è§ £
t ables
Ġtest ing
Ġinter face
target s
ĠPadding Strategy
Ġrand n
LOC K
deprec ated
B E
un used
ãĥ ł
Ġg pu
Ġre pla
Ġen c
ĠE valu
ĠDe berta
Ġitem s
ìĿ´íĶĦ ëĿ¼ìĿ¸
B PE
h istory
Ġs lower
ĠS queeze
Ġse ctions
os en
iv ed
Ġí Ĭ
Ġscal es
sampl ed
Ġcre ating
ĠUs ed
ìĺ ¤
ismatch ed
ĠíĽ Īëł
" })
Į ìĬ¤íĬ¸
Ġw andb
Ġun safe
Ġcom e
mo unt
æķ ´
Ġbin ary
ĠPa per
D ING
G S
M an
f lo
at ely
Ġi de
Ġd id
Ġm atter
ĠO ff
(" _
Ġon es
LI mage
Ġqu estions
def ics
ĠAuto Pipeline
ĠEng lish
D rop
O ne
S ampler
X X
g round
h ip
¢ º
or er
al es
se quential
Ġr ather
ĠF rozen
ĠD E
pos es
Ġë ¬¸
ãĢģ [
Ġch ild
rel ations
CLAS SI
C LIPTextModel
ĠT able
il u
Ġtorch vision
ĠV OCAB
Ġ' .
read er
ë¥ ¸
Ġimple ments
LO W
ĠConfig uration
Ġappro pr
Load ing
Ġf riend
Ġm ade
Ġ( *
to ur
ir s
load s
Ġal gorithm
FI CATION
ĠLayout LMv
Ġlo s
OC O
